nc: 1

scales:
  n: [0.50, 0.25, 1024]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0: P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1: P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3: P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5: P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7: P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [[-1, 6], 1, Concat, [1]] # 12
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [[-1, 4], 1, Concat, [1]] # 15
  - [-1, 2, C3k2, [256, False]] # 16: small

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [[-1, 2], 1, Concat, [1]] # 18
  - [-1, 2, C3k2, [128, False]] # 19: extra-small

  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 16], 1, Concat, [1]] # 21
  - [-1, 2, C3k2, [512, False]] # 22: medium

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 13], 1, Concat, [1]] # 24
  - [-1, 2, C3k2, [1024, True]] # 25: large

  - [[19, 16, 22, 25], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
